Revit 2024 API
AssemblyMemberDifferentType Members
The AssemblyMemberDifferentType type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from AssemblyMemberDifference.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from AssemblyMemberDifference.)
TypeId1
 Type id of the first assembly member
TypeId2
 Type id of the second assembly member
See Also
AssemblyMemberDifferentType Class
Autodesk.Revit.DB Namespace